In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("C:\\Users\\Md Rashid\\Desktop\\r files\\DATAM.csv")

In [3]:
df

   SN no name  marks section
0      1   P1     70       A
1      2   P2     45       B
2      3   P3     72       C
3      4   P4     96       D
4      5   P5     93       E
5      6   P6     94       F
6      7   P7     90       G
7      8   P8     99       H
8      9   P9     98       I

In [4]:
df.head(4)

   SN no name  marks section
0      1   P1     70       A
1      2   P2     45       B
2      3   P3     72       C
3      4   P4     96       D

In [5]:
df.tail(3)

   SN no name  marks section
6      7   P7     90       G
7      8   P8     99       H
8      9   P9     98       I

In [12]:
df['marks'].max()

99

In [13]:
df['marks'].mean()

84.11111111111111

In [14]:
df[['marks','section']]

   marks section
0     70       A
1     45       B
2     72       C
3     96       D
4     93       E
5     94       F
6     90       G
7     99       H
8     98       I

In [15]:
df.marks

0    70
1    45
2    72
3    96
4    93
5    94
6    90
7    99
8    98
Name: marks, dtype: int64

In [16]:
df.['marks']

SyntaxError: invalid syntax (27085594.py, line 1)

In [17]:
df['marks']

0    70
1    45
2    72
3    96
4    93
5    94
6    90
7    99
8    98
Name: marks, dtype: int64

In [18]:
df[df.marks=df.marks.max()]

SyntaxError: invalid syntax (3921271585.py, line 1)

In [19]:
df[df.marks=df.marks.max()]

SyntaxError: invalid syntax (3921271585.py, line 1)

In [20]:
df[df.marks==df.marks.max()]

   SN no name  marks section
7      8   P8     99       H

In [21]:
df.describe()

          SN no      marks
count  9.000000   9.000000
mean   5.000000  84.111111
std    2.738613  18.175839
min    1.000000  45.000000
25%    3.000000  72.000000
50%    5.000000  93.000000
75%    7.000000  96.000000
max    9.000000  99.000000

In [22]:
df.set_index('SN no')

      name  marks section
SN no
1       P1     70       A
2       P2     45       B
3       P3     72       C
4       P4     96       D
5       P5     93       E
6       P6     94       F
7       P7     90       G
8       P8     99       H
9       P9     98       I

In [23]:
df.set_index('name')

      SN no  marks section
name
P1        1     70       A
P2        2     45       B
P3        3     72       C
P4        4     96       D
P5        5     93       E
P6        6     94       F
P7        7     90       G
P8        8     99       H
P9        9     98       I